Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Each Quarkus extension that contributes to Dev UI is represented as a card in the *Extensions* page. These cards provide quick access to features, documentation, configuration, and runtime tools offered by the extension.
ja_jp: Dev UI に貢献する各 Quarkus エクステンションは、 *エクステンション* ページでカードとして表示されます。これらのカードは、エクステンションが提供する機能、ドキュメント、設定、およびランタイムツールへの素早いアクセスを提供します。

source: Each Quarkus platform is defined with a few artifacts.
ja_jp: 各Quarkusプラットフォームは、いくつかのアーティファクトで定義されています。

source: Each WebSocket endpoint callback method execution is associated with a new CDI _request context_ if the endpoint is:
ja_jp: エンドポイントが以下の場合、各 WebSocket エンドポイントコールバックメソッドの実行は、新しい CDI _リクエストコンテキスト_ に関連付けられます。

source: Each `Map` entry represents exactly one query parameter
ja_jp: 各 `Map` エントリは、ちょうど 1 つのクエリーパラメーターを表します

source: Each `String` role element type is parsed as a comma-separated list of roles.
ja_jp: 各 `String` ロール要素タイプは、ロールのカンマ区切りリストとしてパースされます。

source: Each `String` role element type will be parsed as a comma-separated list of roles.
ja_jp: 各 `String` role 要素の型は、カンマで区切られたロールのリストとして解析されます。

source: Each `kids` query parameter must identify the kid they are referencing so that the runtime can figure out which property values go to which members in the list. Here's the curl request:
ja_jp: それぞれの `kids` クエリーパラメーターは、参照している kid を識別する必要があります。これにより、ランタイムはどのプロパティー値がリストのどのメンバーに属するかを把握することができます。これが curl リクエストです。

source: Each application within the system should
ja_jp: システム内の各アプリケーションは

source: Each cache declared using the <<#annotations-api,annotations caching API>> can be monitored using Micrometer metrics.
ja_jp: <<#annotations-api,アノテーションキャッシング API>> を使って宣言された各キャッシュは、Micrometerのメトリクスを使ってモニターすることができます。

source: Each cache declared using the xref:annotations-api[annotations caching API] can be monitored using Micrometer metrics.
ja_jp: xref:annotations-api[アノテーションキャッシングAPI] を使って宣言された各キャッシュは、Micrometerメトリクスを使ってモニタリングすることができます。

source: Each card may include the following elements:
ja_jp: 各カードには以下の要素が含まれる場合があります。

source: Each channel can be disabled via configuration using:
ja_jp: 各チャネルは、以下を使用した設定で無効にできます。

source: Each codestart consists of:
ja_jp: 各 Codestart は以下から構成されています:

source: Each component in the generated SBOM will include the `quarkus:component:scope` property that will indicate whether this component is used at runtime or only development/build time.
ja_jp: 生成された SBOM 内の各コンポーネントには `quarkus:component:scope` プロパティーが含まれています。これは、そのコンポーネントが実行時に使用されるのか、あるいは開発/ビルド時のみに使用されるのかを示しています。

source: Each configuration property, requires a Javadoc explaining its purpose.
ja_jp: 各設定プロパティには、その目的を説明するJavadocが必要です。

source: Each consumer group receives each record from a topic once. To achieve this, it assigns each consumer from a group to a set of partitions. For example, in the above picture, the consumer from the application A1 receives the records from the partitions 0 and 1. A2 receives the records from the partition 2. App B is the only consumer from its consumer group. So, it gets the records from all three partitions. Consequently (ignore rebalance or other subtilities for now), each record from a topic is only received once per consumer group, by a specific consumer from that group.
ja_jp: 各コンシューマーグループは、トピックから各レコードを一度だけ受け取ります。これを実現するために、グループからの各コンシューマーをパーティションのセットに割り当てます。例えば、上の図では、アプリケーションA1のコンシューマーはパーティション0と1からレコードを受信し、A2はパーティション2からレコードを受信します。アプリBは、そのコンシューマグループからの唯一のコンシューマーです。したがって、3つのパーティションすべてからレコードを取得します。したがって、(今のところリバランスや他のサブユーティリティーは無視して)あるトピックの各レコードは、そのグループの特定のコンシューマーによって、コンシューマーグループごとに 1 回だけ受信されます。

source: Each customer functions as a distinct tenant when serving multiple customers from the same application, such as in a SaaS environment. By enabling multitenancy support to your applications, you can support distinct authentication policies for each tenant, even authenticating against different OIDC providers, such as Keycloak and Google.
ja_jp: SaaS 環境など、同じアプリケーションから複数の顧客にサービスを提供する場合、各顧客は個別のテナントとして機能します。 アプリケーションに対してマルチテナンシーサポートを有効にすると、Keycloak や Google などの異なる OIDC プロバイダーに対して認証する場合でも、テナントごとに異なる認証ポリシーをサポートできます。

source: Each customer, whether it be cantons or municipalities, has its own unique requirements and needs. Therefore, each customer has its own clustered Kubernetes environment that is configurable for their specific needs.
ja_jp: 州や市町村などのお客様は、それぞれ独自の要件やニーズをお持ちです。そのため、お客様ごとにクラスター化されたKubernetes環境を用意し、それぞれのニーズに合わせて設定できるようにしています。

source: Each dashboard is tuned for the specific application setup. The available dashboards are:
ja_jp: 各ダッシュボードは、特定のアプリケーション設定に合わせて調整されています。使用可能なダッシュボードは次のとおりです。

source: Each decorator must declare exactly one _delegate injection point_. The decorator applies to beans that are assignable to this delegate injection point.
ja_jp: 各デコレーターは、正確に1つの _デリゲート・インジェクション・ポイント_ を宣言する必要があります。デコレーターは、このデリゲート・インジェクション・ポイントに割り当て可能なBeanに適用されます。

source: Each document should define a header for document-scoped attributes. Minimally, each document should define and id and a title, and include common attributes (`_attributes.adoc`).
ja_jp: 各ドキュメントは、ドキュメントスコープ属性のヘッダを定義すべきです。最低限，各ドキュメントは，idとタイトルを定義し，共通属性( `_attributes.adoc` )を含むべきです。

source: Each endpoint method may consume or produce specific resource representations, which are indicated by the HTTP link:{httpspec}#section-3.1.1.5[`Content-Type`] header, which in turn contains link:{httpspec}#section-3.1.1.1[MIME (Media Type)] values, such as the following:
ja_jp: 各エンドポイントメソッドは、特定のリソース表現を消費したり生成したりする可能性があり、HTTP link:{httpspec}#section-3.1.1.5[`Content-Type`] header で示され、その中に次のような link:{httpspec}#section-3.1.1.1[MIME (Media Type)] 値が含まれています。

source: Each endpoint method must be annotated with one of the following annotations, which defines which HTTP method will be mapped to the method:
ja_jp: 各エンドポイントメソッドには、次のいずれかのアノテーションを付ける必要があります。これにより、どの HTTP メソッドがそのメソッドにマップされるかが定義されます。

source: Each exposed endpoint method can in turn have another link:{jaxrsapi}/jakarta/ws/rs/Path.html[`@Path`] annotation which adds to its containing class annotation. For example, this defines a `rest/hello` endpoint:
ja_jp: 公開された各エンドポイントメソッドは、別の link:{jaxrsapi}/javax/ws/rs/Path.html[`@Path`] アノテーションを持つことができ、それを含むクラスアノテーションを追加されます。例えば、これは `rest/hello` というエンドポイントを定義しています:

source: Each exposed endpoint method can in turn have another link:{jaxrsapi}/javax/ws/rs/Path.html[`@Path`] annotation which adds to its containing class annotation. For example, this defines a `rest/hello` endpoint:
ja_jp: 公開された各エンドポイントメソッドは、別の link:{jaxrsapi}/javax/ws/rs/Path.html[`@Path`] アノテーションを持つことができ、それを含むクラスアノテーションを追加されます。例えば、これは `rest/hello` というエンドポイントを定義しています:

source: Each extension can expose features in this Dev UI, be it to list the CDI beans, list your endpoints, replay your Flyway migrations, deploy to OpenShift... Sky is the limit.
ja_jp: 各エクステンションは、CDI Beanのリスト、エンドポイントのリスト、Flywayマイグレーションのリプレイ、OpenShiftへのデプロイなど、このDev UIで機能を公開することができます。

source: Each extension supports a specific kind of application development, follow the specific guides for more information on how to develop, package and deploy your applications using them.
ja_jp: 各エクステンションは特定の種類のアプリケーション開発をサポートしており、それらを使用してアプリケーションを開発、パッケージ化、デプロイする方法の詳細については、特定のガイドに従ってください。

source: Each extension that provides Dev Services has its own configuration properties for customizing the image name. Refer to the specific extension documentation for details.
ja_jp: Dev Services を提供する各エクステンションには、イメージ名をカスタマイズするための独自の設定プロパティーがあります。詳細は、特定のエクステンションのドキュメントを参照してください。

source: Each extension used in the application will be listed. There, you can find the guides, additional information, and the applicable configuration for each extension:
ja_jp: アプリケーションで使用されるエクステンションがリストされます。各エクステンションのガイド、追加情報、適用可能な設定が表示されます。

source: Each group can be configured with `Class`, or with `TypeReference` objects. `TypeReference` are useful when dealing with Java generics:
ja_jp: 各グループは、 `Class` または `TypeReference` オブジェクトを使用して設定できます。 `TypeReference` は、Java ジェネリックを扱うときに便利です。

source: Each implementation of `io.smallrye.config.ConfigSourceFactory` requires registration via the https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] mechanism in the `META-INF/services/io.smallrye.config.ConfigSourceFactory` file.
ja_jp: `io.smallrye.config.ConfigSourceFactory` の各実装は、 `META-INF/services/io.smallrye.config.ConfigSourceFactory` ファイルの link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader]メカニズムを介して登録する必要があります。

source: Each implementation of `io.smallrye.config.ConfigSourceFactory` requires registration via the https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] mechanism in the `META-INF/services/io.smallrye.config.ConfigSourceFactory` file.
ja_jp: `io.smallrye.config.ConfigSourceFactory` の各実装には、 `META-INF/services/io.smallrye.config.ConfigSourceFactory` ファイル内の link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] メカニズムによる登録が必要です。

source: Each individual service can also be run via Docker Compose.
ja_jp: 個々のサービスは、Docker Composeを介して実行することもできます。

source: Each line follows the format `PORT_<containerPort>=<hostPort>`, where _containerPort_ is the port exposed by the container and _hostPort_ is the dynamically assigned port on the host. The container command can wait until the file is present, and then source this file to access these mappings as environment variables:
ja_jp: 各行は `PORT_<containerPort>=<hostPort>` の形式に従います。ここで _containerPort_ はコンテナーによって公開されるポートであり、 _hostPort_ はホストに動的に割り当てられるポートです。コンテナーコマンドはファイルが存在するまで待機し、このファイルをソースとしてこれらのマッピングに環境変数としてアクセスできます:

source: Each line in a localized file represents a key/value pair. The key must correspond to a method declared on the message bundle interface. The value is the message template.
ja_jp: ローカライズされたファイルの各行は、キーと値のペアを表します。キーは、メッセージバンドルインターフェイスで宣言されたメソッドに対応しなければなりません。値はメッセージテンプレートになります。

source: Each method invocation is intercepted if there is an interceptor associated with `Logged`.
ja_jp: 各メソッドの呼び出しは、 `Logged` に関連付けられたインターセプターがある場合に傍受されます。

source: Each method must be annotated with `@Message`. The value is a qute template.
ja_jp: 各メソッドは `@Message` でアノテーションする必要があります。値は qute テンプレートです。

source: Each method must be annotated with `@Message`. The value is a qute template. If no value is provided, then a corresponding value from a localized file is taken. If no such file exists an exception is thrown and the build fails.
ja_jp: 各メソッドには `@Message` のアノテーションが必要です。その値はquteテンプレートです。値が提供されない場合、ローカライズされたファイルから対応する値が取得されます。もし、そのようなファイルがなければ、例外がスローされ、ビルドは失敗します。

source: Each method must be annotated with `@Message`. The value is a qute template. If no value is provided, then a corresponding value from a localized file is taken. If no such file exists, an exception is thrown and the build fails.
ja_jp: 各メソッドには `@Message` のアノテーションが必要です。その値は qute テンプレートです。値が指定されていない場合、ローカライズされたファイルから対応する値が取得されます。該当するファイルがない場合は例外がスローされ、ビルドは失敗します。

source: Each non-primitive method argument that is part of the key must implement `equals()` and `hashCode()` correctly for the cache to work as expected.
ja_jp: キーの一部である非プリミティブメソッドの各引数は、キャッシュが期待通りに動作するために、 `equals()` と `hashCode()` を正しく実装する必要があります。

source: Each of the Caffeine caches backing up the Quarkus application data caching extension can be configured using the following properties in the `application.properties` file. By default caches do not perform any type of eviction if not configured.
ja_jp: Quarkusアプリケーションのデータキャッシュエクステンションを支える各Caffeineキャッシュは、 `application.properties` ファイルの以下のプロパティーを使用して設定することができます。デフォルトでは、設定されていない場合、キャッシュはどのようなタイプの退避も実行しません。

source: Each of the Caffeine caches backing up the Quarkus application data caching extension can be configured using the following properties in the `application.properties` file. By default, caches do not perform any type of eviction if not configured.
ja_jp: Quarkusアプリケーションのデータキャッシュエクステンションをバックアップする各Caffeineキャッシュは、 `application.properties` ファイルの以下のプロパティーを使用して設定することができます。デフォルトでは、設定されていない場合、キャッシュはどのようなタイプのエヴィクションも実行しません。

source: Each of the services can also be run via https://quarkus.io/guides/maven-tooling#dev-mode[Quarkus Dev Mode^] simultaneously. For each Quarkus service (`+event-statistics+`, `+rest-fights+`, `+rest-heroes+`, `+rest-villains+`) open a terminal, `+cd+` into the project directory, and run `+./mvnw quarkus:dev+`.
ja_jp: 各サービスは、 link:https://quarkus.io/guides/maven-tooling#dev-mode[Quarkus Dev Mode, window=_blank]を介して同時に実行することもできます。各Quarkusサービス（ `event-statistics`, `rest-fights`, `rest-heroes`, `rest-villains` ）について、ターミナルを開き、 `cd` をプロジェクトディレクトリに入れて、 `./mvnw quarkus:dev` を実行してください。

source: Each of the supported databases contains different JDBC URL configuration options. Going into each of those options is beyond the scope of this document, but the following section gives an overview of each database URL and a link to the official documentation.
ja_jp: サポートされているデータベースにはそれぞれ異なる JDBC URL 設定オプションがあります。それぞれのオプションについては、本ドキュメントの説明範囲を超えていますが、以下のセクションでは各データベースの URL の概要と公式ドキュメントへのリンクを示します。

source: Each of the supported databases contains different JDBC URL configuration options. The following section gives an overview of each database URL and a link to the official documentation.
ja_jp: サポートされているデータベースには、それぞれ異なる JDBC URL 設定オプションがあります。以下のセクションでは、各データベース URL の概要と公式ドキュメントへのリンクを示します。

source: Each of these methods returns an object that lets you execute the commands related to the group. The following snippet demonstrates how to use the _hash_ group:
ja_jp: これらのメソッドはそれぞれ、そのグループに関連するコマンドを実行することができるオブジェクトを返します。以下のスニペットは、_ハッシュ_ グループの使い方を示しています。

source: Each provided capability will be represented with an instance of `io.quarkus.deployment.builditem.CapabilityBuildItem` at build time. Theoretically, `CapabilityBuildItem`'s could be produced by extension build steps directly, bypassing the corresponding declaration in the extension descriptors. However, this way of providing capabilities should be avoided, unless there is a very good reason not to declare a capability in the descriptor.
ja_jp: 提供された各ケイパビリティはビルド時に `io.quarkus.deployment.builditem.CapabilityBuildItem` のインスタンスで表されます。理論的には、 `CapabilityBuildItem'sはエクステンションのビルドステップで直接生成することができ、エクステンションの記述子で対応する宣言をバイパスします。しかし、ケイパビリティを提供するこの方法は、記述子で能力を宣言しない非常に良い理由がない限り、避けるべきです。

source: Each provider declaration will request one or more token scopes added to access tokens issued by a given provider. For example, `quarkus.oidc.provider=google` will request `Google` to add `openid`, `email` and `profile` scopes.
ja_jp: 各プロバイダー宣言は、特定のプロバイダーによって発行されたアクセストークンに追加される 1 つ以上のトークンスコープを要求します。たとえば、 `quarkus.oidc.provider=google` は、 `Google` に `openid`、 `email`、および `profile` スコープを追加するように要求します。

source: Each route can use different paths, methods...
ja_jp: 各ルートは、異なるパスやメソッドなどを使用できます。

source: Each subcommand corresponds to an image building tool supported by Quarkus and gives access to specific configuration options.
ja_jp: 各サブコマンドは、Quarkusがサポートしているイメージビルドツールに対応しており、特定の設定オプションにアクセスできます。

source: Each supported database has its own JDBC URL configuration options. The following sections describe each JDBC URL and provide a link to the official documentation.
ja_jp: サポートされている各データベースには、固有の JDBC URL 設定オプションがあります。以下のセクションでは各 JDBC URL について説明し、公式ドキュメントへのリンクを提供します。

source: Each test method must be annotated with `@Launch` to automatically start the application or have a `QuarkusMainLauncher` parameter to manually launch the application.
ja_jp: 各テストメソッドは、アプリケーションを自動的に起動するために `@Launch` のアノテーションを付けるか、手動で起動するために `QuarkusMainLauncher` のパラメータを持つ必要があります。

source: Each time deployment is requested, a container image build will be implicitly triggered (no additional properties are required when the Kubernetes deployment has been enabled).
ja_jp: デプロイが要求されるたびに、暗黙のうちにコンテナーイメージのビルドがトリガーされます(Kubernetes のデプロイが有効になっている場合は、追加のプロパティーは必要ありません)。

source: Each topic has messages in ONE format (either v2 or v3, not both)
ja_jp: 各トピックのメッセージが単一の形式 (v2 または v3 のいずれか一方のみ) であること

source: Each translation file is a plain JavaScript module following one of these naming patterns:
ja_jp: 各翻訳ファイルは、次のいずれかの命名パターンに従うプレーンな JavaScript モジュールです。

source: Each translation file must export a constant named `templates` containing key–value pairs:
ja_jp: 各翻訳ファイルは、キーと値のペアを含む `templates` という定数をエクスポートする必要があります。

source: Each unique combination of metric name and dimension produces a unique time series. Using an unbounded set of dimensional data (many different values like a userId) can lead to a "cardinality explosion", an exponential increase in the creation of new time series. Avoid!
ja_jp: メトリクス名とディメンションを組み合わせると、その一意の組み合わせごとに、一意の時系列が生成されます。 無制限の次元データセット (userId などのさまざまな値) を使用すると、"カーディナリティーの急増 (cardinality explosion)"、つまり新しい時系列の作成が指数関数的に増加する可能性があります。 これは回避するようにしてください。

source: Each unique combination of metric name and dimension produces a unique time series. Using an unbounded set of dimensional data can lead to a "cardinality explosion", an exponential increase in the creation of new time series.
ja_jp: メトリクス名とディメンションの一意の組み合わせごとに、一意の時系列が生成されます。 無制限のディメンションデータセットを使用すると、「カーディナリティーの爆発」、つまり新しい時系列の作成が指数関数的に増加する可能性があります。

source: Each with its configuration:
ja_jp: それぞれの設定は次のとおりです。

source: Eager Instantiation of Beans
ja_jp: Bean インスタンス化の意向

source: Eager to migrate your existing applications? Here is https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.10[our migration guide for 1.10].
ja_jp: 既存のアプリケーションの移行をお考えですか?ここに https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.10[1.10への移行ガイド]があります。

source: Eager to migrate your existing applications? Here is https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.11[our migration guide for 1.11].
ja_jp: 既存のアプリケーションの移行をお考えですか? link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.11[1.11の移行ガイド]はこちらです。

source: Eager to migrate your existing applications? Here is https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.12[our migration guide for 1.12].
ja_jp: 既存のアプリケーションの移行をお考えですか？ここに link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.12[1.12の移行ガイド]があります。

source: Eager to migrate your existing applications? Here is https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.13[our migration guide for 1.13].
ja_jp: 既存のアプリケーションを移行したいとお考えですか？ここでは、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.13[1.13の移行ガイド]をご紹介します。

source: Eager to migrate your existing applications? Here is https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.8[our migration guide for 1.8].
ja_jp: 既存のアプリケーションの移行をお考えですか? link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.8[1.8の移行ガイド] はこちらです。

source: Eager to migrate your existing applications? Here is https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.9[our migration guide for 1.9].
ja_jp: 既存のアプリケーションの移行をお考えですか?ここに link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.9[1.9の移行ガイド] があります。

source: Eager vs Lazy Initialization
ja_jp: Eager (先行) vs Lazy (遅延) 初期化

source: Earlier this year we discovered a memory leak in the RESTEasy Reactive component in Quarkus. Within a few days, working with the Quarkus community, we were able to identify and fix the issue. This gave us the confidence that longer term, we’ll be able to resolve issues quickly.
ja_jp: 今年の初めに、QuarkusのRESTEasy Reactiveコンポーネントにメモリリークがあることがわかりました。数日のうちに、Quarkusのコミュニティと協力して、問題を特定して修正することができました。これにより、長期的には問題を迅速に解決することができるという確信を得ることができました。

source: Easily build AI workflows with minimal code, leveraging top LLM providers to create features like chatbots and summarizers.
ja_jp: 最小限のコードでAIワークフローを簡単に構築し、主要なLLMプロバイダーを活用してチャットボットや要約機能などの機能を作成します。

source: Easily extendable to support other backends
ja_jp: 他のバックエンドをサポートするための容易な拡張性

source: Easy Launch debug/dev:mode
ja_jp: debug/dev:mode の簡単起動

source: Easy Quarkus-based scripting with jbang.
ja_jp: jbangを使った簡単なQuarkusベースのスクリプティング方法です。

source: Eclipse Adoptium Uses Quarkus for high volume Java SE distribution API
ja_jp: Eclipse Adoptium、大量Java SE配布APIにQuarkusを採用

source: Eclipse MicroProfile 4 and major changes in the SmallRye components
ja_jp: Eclipse MicroProfile 4とSmallRyeコンポーネントの大幅な変更

source: Eclipse MicroProfile 6.0 aligns with Jakarta EE 10 Core Profile and replaces MicroProfile OpenTracing with MicroProfile Telemetry.
ja_jp: Eclipse MicroProfile 6.0 は Jakarta EE 10 Core Profile と整合し、MicroProfile OpenTracing を MicroProfile Telemetry に置き換えています。

source: Eclipse Vert.x supplies the fundamental HTTP layer. For Servlet support, Quarkus employs a customized Undertow version that operates on top of Vert.x, while Jakarta REST support is delivered through RESTEasy.
ja_jp: Eclipse Vert.xは、基本的なHTTPレイヤーを提供します。 Servletのサポートのために、QuarkusはVert.xの上で動作するカスタマイズされたUndertowバージョンを使用し、Jakarta RESTのサポートはRESTEasyを通じて提供されます。

source: Eclipse plugin to install into Eclipse using an update-site
ja_jp: アップデートサイトを使ってEclipseにインストールするEclipseプラグイン

source: Eclipse plugin to install into Eclipse using an updatesite
ja_jp: アップデートサイトを使ってEclipseにインストールするEclipseプラグイン

source: Eclipse separate JRE definition
ja_jp: Eclipse の別個の JRE 定義

source: Ecosystem
ja_jp: エコシステム

source: Ecosystem compatibility: Works seamlessly with https://github.com/operator-framework/java-operator-sdk[Java-based Kubernetes operators]
ja_jp: エコシステムの互換性: https://github.com/operator-framework/java-operator-sdk[Java ベースの Kubernetes オペレーター] とシームレスに連携します。

source: Ecosystem integration
ja_jp: エコシステムの統合

source: Edit `src/main/resources/application.properties` and inject the following configuration:
ja_jp: 以下の内容の `src/main/resources/import.sql` ファイルを作成してみましょう:

source: Edit `~/.testcontainers.properties` and add the following line
ja_jp: `~/.testcontainers.properties` を編集し、以下の行を追加します。

source: Edit the <<codestart-yml>>:
ja_jp: <<codestart-yml>>を編集します。

source: Edit the `GreetingResource` class to inject the `GreetingService` and create a new endpoint using it:
ja_jp: `GreetingResource` クラスを編集して `GreetingService` を注入し、それを使用して新しいエンドポイントを作成します。

source: Edit the `application.properties` file and add the `cron.expr` and the `fixedRate.expr` configuration:
ja_jp: `application.properties` ファイルを編集し、 `cron.expr` と `fixedRate.expr` の設定を追加します:

source: Edit the `application.properties` file and add the `cron.expr` configuration:
ja_jp: `application.properties` ファイルを編集し、 `cron.expr` の設定を追加します:

source: Edit the `application.properties` file and add the below configuration:
ja_jp: `application.properties` ファイルを編集し、以下の設定を追加します:

source: Edit the `org.acme.config.GreetingResource`, and introduce the following configuration properties:
ja_jp: `org.acme.config.GreetingResource` を編集し、以下の設定プロパティーを導入します:

source: Edit the `org.acme.microprofile.graphql.FilmResource` class as following:
ja_jp: `org.acme.microprofile.graphql.FilmResource` クラスを以下のように編集します。

source: Edit the `pom.xml` file to add the Quarkus gRPC extension dependency (just under `<dependencies>`):
ja_jp: `pom.xml` ファイルを編集して、Quarkus gRPCエクステンションの依存関係を追加します( `<dependencies>` のすぐ下)。

source: Edit the `pom.xml` file to add the Quarkus gRPC xDS dependency (just under `<dependencies>`):
ja_jp: `pom.xml` ファイルを編集して、（ `<dependencies>` の直下に）Quarkus gRPC xDS 依存関係を追加します：

source: Edit the `pom.xml` file to add the following dependency:
ja_jp: `pom.xml` ファイルを編集し、以下の依存関係を追加します:

source: Edit the `quarksapp` class to inject the `GreetingService` and create a new endpoint using it, you should end up with something like:
ja_jp: `quarksapp` クラスを編集して `GreetingService` を注入し、それを使って新しいエンドポイントを作成します。

source: Edit the file with the following content:
ja_jp: 以下の内容でファイルを編集します:

source: Edit this Page
ja_jp: このページを編集
